InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ШтрихкодыНоменклатуры/Forms/ФормаСписка/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////////////////////////
//// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//// Меняет ресурс записи НеИспользуется на Ложь,
//// если нет дублей ШК
////
//&НаСервереБезКонтекста
//Функция ВосстановитьШтрихкодСервер(КлючЗаписи)

//	РазрешеныДублиШтрихКодов = Константы.РазрешитьДублиШК.Получить();
//	
//	Если НЕ РазрешеныДублиШтрихКодов Тогда
//		ДанныеШтрихкода = РегистрыСведений.ШтрихкодыНоменклатуры.ПроверитьУникальностьШтрихкода(КлючЗаписи.Штрихкод, КлючЗаписи.Номенклатура, КлючЗаписи.ХарактеристикаНоменклатуры, КлючЗаписи.ЕдиницаИзмерения);
//	КонецЕсли;	
//		
//	Если РазрешеныДублиШтрихКодов ИЛИ НЕ ДанныеШтрихкода.Используется Тогда
//		
//		НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
//		
//		НаборЗаписей.Отбор.Номенклатура.Установить(КлючЗаписи.Номенклатура);
//		НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(КлючЗаписи.ХарактеристикаНоменклатуры);
//		НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(КлючЗаписи.ЕдиницаИзмерения);
//		НаборЗаписей.Отбор.Штрихкод.Установить(КлючЗаписи.Штрихкод);
//		
//		НаборЗаписей.Прочитать();
//		
//		НаборЗаписей[0].НеИспользуется = Ложь;
//		
//		НаборЗаписей.Записать(Истина);
//		
//	КонецЕсли;
//	
//	Если НЕ РазрешеныДублиШтрихКодов Тогда
//		Возврат ДанныеШтрихкода;
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;

//КонецФункции // УдалитьШтрихкодСервер()

//// Меняет ресурс записи НеИспользуется на Истина
////
//&НаСервереБезКонтекста
//Процедура УдалитьШтрихкодСервер(КлючЗаписи)

//	НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
//	
//	НаборЗаписей.Отбор.Номенклатура.Установить(КлючЗаписи.Номенклатура);
//	НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(КлючЗаписи.ХарактеристикаНоменклатуры);
//	НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(КлючЗаписи.ЕдиницаИзмерения);
//	НаборЗаписей.Отбор.Штрихкод.Установить(КлючЗаписи.Штрихкод);
//	
//	НаборЗаписей.Прочитать();
//	
//	НаборЗаписей[0].НеИспользуется = Истина;
//	
//	НаборЗаписей.Записать(Истина);

//КонецПроцедуры // УдалитьШтрихкодСервер()

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СформироватьШтрихкод(Команда)

	ПараметрыФормы = Новый Структура("СформироватьНовый", Истина);
	
	ПараметрыФормы.Вставить("Номенклатура"                 , Номенклатура);
	ПараметрыФормы.Вставить("Характеристика"               , ХарактеристикаНоменклатуры);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения"             , ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ЗаблокироватьНоменклатуру"    , ЗначениеЗаполнено(Номенклатура));
	ПараметрыФормы.Вставить("ЗаблокироватьХарактеристику"  , ЗначениеЗаполнено(ХарактеристикаНоменклатуры));
	ПараметрыФормы.Вставить("ЗаблокироватьЕдиницуИзмерения", ЗначениеЗаполнено(ЕдиницаИзмерения));
	
	ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПоказатьНеиспользуемые(Команда)
//	
//	ОтборИспользуемых = НЕ ОтборИспользуемых;
//	
//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НеИспользуется", Ложь,,, ОтборИспользуемых);
//	Элементы.КнопкаПоказатьНеиспользуемые.Пометка = НЕ ОтборИспользуемых;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
//	
//	Отказ = Истина;
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("ЗаблокироватьНоменклатуру"    , ЗначениеЗаполнено(Номенклатура));
//	ПараметрыФормы.Вставить("ЗаблокироватьХарактеристику"  , ЗначениеЗаполнено(ХарактеристикаНоменклатуры));
//	ПараметрыФормы.Вставить("ЗаблокироватьЕдиницуИзмерения", ЗначениеЗаполнено(ЕдиницаИзмерения));
//	
//	Если Копирование Тогда
//		ТекСтрока = Элементы.Список.ТекущиеДанные;
//		ПараметрыФормы.Вставить("Номенклатура"  , ТекСтрока.Номенклатура);
//		ПараметрыФормы.Вставить("Характеристика", ТекСтрока.ХарактеристикаНоменклатуры);
//		ПараметрыФормы.Вставить("Штрихкод"      , ТекСтрока.Штрихкод);
//		
//		Если ТипЗнч(ТекСтрока.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
//			ПараметрыФормы.Вставить("ЕдиницаИзмерения", ТекСтрока.ЕдиницаИзмерения);
//		КонецЕсли;
//		
//	Иначе
//		ПараметрыФормы.Вставить("Номенклатура"    , Номенклатура);
//		ПараметрыФормы.Вставить("Характеристика"  , ХарактеристикаНоменклатуры);
//		ПараметрыФормы.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
//	КонецЕсли;
//	
//	ОткрытьФормуМодально("РегистрСведений.ШтрихкодыНоменклатуры.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
//	
//	Элементы.Список.Обновить();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СписокПередУдалением(Элемент, Отказ)
//	
//	Отказ = Истина;
//	
//	ТребуетсяОбновлениеСписка = Истина;
//	
//	Если Элементы.Список.ТекущиеДанные.НеИспользуется Тогда
//		
//		ТекстВопроса = НСтр("ru = 'Снять со штрих-кода %Штрихкод% пометку неиспользуемого?'");
//		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%Штрихкод%", Элементы.Список.ТекущиеДанные.Штрихкод);
//		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
//		Если Ответ = КодВозвратаДиалога.Нет Тогда
//			Возврат;
//		КонецЕсли;
//		
//		ДанныеШтрихкода = ВосстановитьШтрихкодСервер(Элементы.Список.ТекущаяСтрока);
//		
//		Если ДанныеШтрихкода <> Неопределено И ДанныеШтрихкода.Используется Тогда
//			
//			ТекстСообщения = НСтр("ru = 'Штрихкод ""%Штрихкод%"" уже используется у товара 
//											|%ПредставлениеТовара%.
//											|
//											|Дубли штрих-кодов запрещены. Снятие пометки удаления не выполнено.'");
//				
//			ПредставлениеТовара = ОбщегоНазначенияДУМКлиентСервер.СформироватьСтрокуИнформацииОТоваре(ДанныеШтрихкода.НаименованиеНоменклатуры,
//																										  ДанныеШтрихкода.Код,
//																										  ДанныеШтрихкода.Артикул,
//																										  ДанныеШтрихкода.НаименованиеХарактеристики);
//			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Штрихкод%", Элементы.Список.ТекущиеДанные.Штрихкод);
//			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеТовара%", ПредставлениеТовара);
//				
//			Предупреждение(ТекстСообщения);
//				
//			ТребуетсяОбновлениеСписка = Ложь;
//		КонецЕсли;
//		
//	Иначе
//		
//		ТекстВопроса = НСтр("ru = 'Пометить штрих-код %Штрихкод% как неиспользуемый?'");
//		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%Штрихкод%", Элементы.Список.ТекущиеДанные.Штрихкод);
//		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
//		Если Ответ = КодВозвратаДиалога.Нет Тогда
//			Возврат;
//		КонецЕсли;
//		
//		УдалитьШтрихкодСервер(Элементы.Список.ТекущаяСтрока);
//		
//	КонецЕсли;
//	
//	Если ТребуетсяОбновлениеСписка Тогда
//		Элементы.Список.Обновить();
//		ОповеститьОбИзменении(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
//	КонецЕсли;
//	
//КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Количество() > 0 Тогда

//		Параметры.Отбор.Свойство("ЕдиницаИзмерения", ЕдиницаИзмерения);
//		Параметры.Отбор.Свойство("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
//		Параметры.Отбор.Свойство("Номенклатура", Номенклатура);
//		
//		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
//			Номенклатура = ?(ЗначениеЗаполнено(ХарактеристикаНоменклатуры), ХарактеристикаНоменклатуры.Владелец, ЕдиницаИзмерения.Владелец);
//		КонецЕсли;

//	Иначе
//		Элементы.КнопкаСформироватьШтрихкод.Видимость = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//	Если ОтборИспользуемых Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
//			Список, "НеИспользуется", Ложь,,, Истина);
//	Иначе
//		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
//			Список, "НеИспользуется",,,, Ложь);
//		Элементы.КнопкаПоказатьНеиспользуемые.Пометка = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
//	
//	Если Настройки["ОтборИспользуемых"] = Неопределено Тогда
//		ОтборИспользуемых = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	
//	Если Источник = "ТорговоеОборудование" И ВводДоступен() И ИмяСобытия = "ScanData" Тогда
//		Штрихкод = Параметр[0].Штрихкод;
//		ШтрихкодированиеКлиент.ПриДобавленииШКСканером(Штрихкод, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтаФорма);
//	КонецЕсли;  

//КонецПроцедуры
